einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_uart.c
/* Copyright (c) 2016-2025, DF9DQ
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright notice, this list
 * of conditions and the following disclaimer.
 * Redistributions in binary form must reproduce the above copyright notice, this list
 * of conditions and the following disclaimer in the documentation and/or
 * other materials provided with the distribution.
 * Neither the name of the author nor the names of its contributors may be used
 * to endorse or promote products derived from this software without specific
 * prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "lpc54xxx_libconfig.h"

#include "lpc54xxx_clkpwr.h"
#include "lpc54xxx_flexcomm.h"
#include "lpc54xxx_uart.h"


LPCLIB_DefineRegBit(UART_CFG_ENABLE,                0,  1);
LPCLIB_DefineRegBit(UART_CFG_DATALEN,               2,  2);
LPCLIB_DefineRegBit(UART_CFG_PARITYSEL,             4,  2);
LPCLIB_DefineRegBit(UART_CFG_STOPLEN,               6,  1);
LPCLIB_DefineRegBit(UART_CFG_MODE32K,               7,  1);
LPCLIB_DefineRegBit(UART_CFG_LINMODE,               8,  1);
LPCLIB_DefineRegBit(UART_CFG_CTSEN,                 9,  1);
LPCLIB_DefineRegBit(UART_CFG_SYNCEN,                11, 1);
LPCLIB_DefineRegBit(UART_CFG_CLKPOL,                12, 1);
LPCLIB_DefineRegBit(UART_CFG_SYNCMST,               14, 1);
LPCLIB_DefineRegBit(UART_CFG_LOOP,                  15, 1);
LPCLIB_DefineRegBit(UART_CFG_OETA,                  18, 1);
LPCLIB_DefineRegBit(UART_CFG_AUTOADDR,              19, 1);
LPCLIB_DefineRegBit(UART_CFG_OESEL,                 20, 1);
LPCLIB_DefineRegBit(UART_CFG_OEPOL,                 21, 1);
LPCLIB_DefineRegBit(UART_CFG_RXPOL,                 22, 1);
LPCLIB_DefineRegBit(UART_CFG_TXPOL,                 23, 1);

LPCLIB_DefineRegBit(UART_CTL_TXBRKEN,               1,  1);
LPCLIB_DefineRegBit(UART_CTL_ADDRDET,               2,  1);
LPCLIB_DefineRegBit(UART_CTL_TXDIS,                 6,  1);
LPCLIB_DefineRegBit(UART_CTL_CC,                    8,  1);
LPCLIB_DefineRegBit(UART_CTL_CLRCCONRX,             9,  1);
LPCLIB_DefineRegBit(UART_CTL_AUTOBAUD,              16, 1);

LPCLIB_DefineRegBit(UART_STAT_RXRDY,                0,  1);
LPCLIB_DefineRegBit(UART_STAT_RXIDLE,               1,  1);
LPCLIB_DefineRegBit(UART_STAT_TXRDY,                2,  1);
LPCLIB_DefineRegBit(UART_STAT_TXIDLE,               3,  1);
LPCLIB_DefineRegBit(UART_STAT_CTS,                  4,  1);
LPCLIB_DefineRegBit(UART_STAT_DELTACTS,             5,  1);
LPCLIB_DefineRegBit(UART_STAT_TXDISSTAT,            6,  1);
LPCLIB_DefineRegBit(UART_STAT_OVERRUNINT,           8,  1);
LPCLIB_DefineRegBit(UART_STAT_RXBRK,                10, 1);
LPCLIB_DefineRegBit(UART_STAT_DELTARXBRK,           11, 1);
LPCLIB_DefineRegBit(UART_STAT_START,                12, 1);
LPCLIB_DefineRegBit(UART_STAT_FRAMEERRINT,          13, 1);
LPCLIB_DefineRegBit(UART_STAT_PARITYERRINT,         14, 1);
LPCLIB_DefineRegBit(UART_STAT_RXNOISEINT,           15, 1);
LPCLIB_DefineRegBit(UART_STAT_ABERR,                16, 1);

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
LPCLIB_DefineRegBit(UART_INTENSET_RXRDYEN,          0,  1);
LPCLIB_DefineRegBit(UART_INTENSET_TXRDYEN,          2,  1);
#endif
LPCLIB_DefineRegBit(UART_INTENSET_TXIDLEEN,         3,  1);
LPCLIB_DefineRegBit(UART_INTENSET_DELTACTSEN,       5,  1);
LPCLIB_DefineRegBit(UART_INTENSET_TXDISEN,          6,  1);
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
LPCLIB_DefineRegBit(UART_INTENSET_OVERRUNEN,        8,  1);
#endif
LPCLIB_DefineRegBit(UART_INTENSET_DELTARXBRKEN,     11, 1);
LPCLIB_DefineRegBit(UART_INTENSET_STARTEN,          12, 1);
LPCLIB_DefineRegBit(UART_INTENSET_FRAMEERREN,       13, 1);
LPCLIB_DefineRegBit(UART_INTENSET_PARITYERREN,      14, 1);
LPCLIB_DefineRegBit(UART_INTENSET_RXNOISECLREN,     15, 1);
LPCLIB_DefineRegBit(UART_INTENSET_ABERREN,          16, 1);

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
LPCLIB_DefineRegBit(UART_INTENCLR_RXRDYCLR,         0,  1);
LPCLIB_DefineRegBit(UART_INTENCLR_TXRDYCLR,         2,  1);
#endif
LPCLIB_DefineRegBit(UART_INTENCLR_TXIDLECLR,        3,  1);
LPCLIB_DefineRegBit(UART_INTENCLR_DELTACTSCLR,      5,  1);
LPCLIB_DefineRegBit(UART_INTENCLR_TXDISCLR,         6,  1);
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
LPCLIB_DefineRegBit(UART_INTENCLR_OVERRUNCLR,       8,  1);
#endif
LPCLIB_DefineRegBit(UART_INTENCLR_DELTARXBRKCLR,    11, 1);
LPCLIB_DefineRegBit(UART_INTENCLR_STARTCLR,         12, 1);
LPCLIB_DefineRegBit(UART_INTENCLR_FRAMEERRCLR,      13, 1);
LPCLIB_DefineRegBit(UART_INTENCLR_PARITYERRCLR,     14, 1);
LPCLIB_DefineRegBit(UART_INTENCLR_RXNOISECLRCLR,    15, 1);
LPCLIB_DefineRegBit(UART_INTENCLR_ABERRCLR,         16, 1);

LPCLIB_DefineRegBit(UART_OSR_OSRVAL,                0,  4);

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
LPCLIB_DefineRegBit(UART_FIFOCFG_ENABLETX,          0,  1);
LPCLIB_DefineRegBit(UART_FIFOCFG_ENABLERX,          1,  1);
LPCLIB_DefineRegBit(UART_FIFOCFG_SIZE,              4,  2);
LPCLIB_DefineRegBit(UART_FIFOCFG_DMATX,             12, 1);
LPCLIB_DefineRegBit(UART_FIFOCFG_DMARX,             13, 1);
LPCLIB_DefineRegBit(UART_FIFOCFG_WAKETX,            14, 1);
LPCLIB_DefineRegBit(UART_FIFOCFG_WAKERX,            15, 1);
LPCLIB_DefineRegBit(UART_FIFOCFG_EMPTYTX,           16, 1);
LPCLIB_DefineRegBit(UART_FIFOCFG_EMPTYRX,           17, 1);
#define UART_FIFOCFG_READMASK (0        \
    | UART_FIFOCFG_ENABLETX_Msk         \
    | UART_FIFOCFG_ENABLERX_Msk         \
    | UART_FIFOCFG_SIZE_Msk             \
    | UART_FIFOCFG_DMATX_Msk            \
    | UART_FIFOCFG_DMARX_Msk            \
    | UART_FIFOCFG_WAKETX_Msk           \
    | UART_FIFOCFG_WAKERX_Msk           \
    )

LPCLIB_DefineRegBit(UART_FIFOTRIG_TXLVLENA,         0,  1);
LPCLIB_DefineRegBit(UART_FIFOTRIG_RXLVLENA,         1,  1);
LPCLIB_DefineRegBit(UART_FIFOTRIG_TXLVL,            8,  4);
LPCLIB_DefineRegBit(UART_FIFOTRIG_RXLVL,            16, 4);

