einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_uart.c
LPCLIB_DefineRegBit(UART_FIFOINTENSET_TXERR,        0,  1);
LPCLIB_DefineRegBit(UART_FIFOINTENSET_RXERR,        1,  1);
LPCLIB_DefineRegBit(UART_FIFOINTENSET_TXLVL,        2,  1);
LPCLIB_DefineRegBit(UART_FIFOINTENSET_RXLVL,        3,  1);

LPCLIB_DefineRegBit(UART_FIFOINTENCLR_TXERR,        0,  1);
LPCLIB_DefineRegBit(UART_FIFOINTENCLR_RXERR,        1,  1);
LPCLIB_DefineRegBit(UART_FIFOINTENCLR_TXLVL,        2,  1);
LPCLIB_DefineRegBit(UART_FIFOINTENCLR_RXLVL,        3,  1);

LPCLIB_DefineRegBit(UART_FIFOINTSTAT_TXERR,         0,  1);
LPCLIB_DefineRegBit(UART_FIFOINTSTAT_RXERR,         1,  1);
LPCLIB_DefineRegBit(UART_FIFOINTSTAT_TXLVL,         2,  1);
LPCLIB_DefineRegBit(UART_FIFOINTSTAT_RXLVL,         3,  1);
LPCLIB_DefineRegBit(UART_FIFOINTSTAT_PERINT,        4,  1);
#endif


/** Local context of UART's. */
static struct UART_Context {
    UART_Name bus;                          /**< Bus identifier */
    LPCLIB_Switch inUse;                    /**< Set if interface open */

    osMutexId accessMutex;
    osSemaphoreId syncSema;
    LPCLIB_Callback callback;

    uint8_t *pRxBuffer;
    uint32_t rxBufferSize;
  #if LPCLIB_UART_ERROR_HANDLING
    uint8_t rxErrors[LPCLIB_UART_RX_BUFFER_SIZE];
  #endif
    volatile uint32_t rxWriteIndex;
    uint32_t rxReadIndex;

    uint8_t *pTxBuffer;
    uint32_t txBufferSize;
    uint32_t txWriteIndex;
    volatile uint32_t txReadIndex;
    bool txActive;                          /**< IRQ driven TX active */
    bool txSyncMode;
} uartContext[UART_NUM_UARTS];


//TODO make sure we have enough (and not more) mutexes/syncs!
//TODO must have *globally* unique name...
osMutexDef(uartAccessMutexDef0);
osMutexDef(uartAccessMutexDef1);
osMutexDef(uartAccessMutexDef2);
osMutexDef(uartAccessMutexDef3);
osSemaphoreDef(uartSyncSemaDef0);
osSemaphoreDef(uartSyncSemaDef1);
osSemaphoreDef(uartSyncSemaDef2);
osSemaphoreDef(uartSyncSemaDef3);

static const osMutexDef_t * const uartMutexes[UART_NUM_UARTS] = {
    osMutex(uartAccessMutexDef0),
    osMutex(uartAccessMutexDef1),
    osMutex(uartAccessMutexDef2),
    osMutex(uartAccessMutexDef3),
    };
static const osSemaphoreDef_t * const uartSemas[UART_NUM_UARTS] = {
    osSemaphore(uartSyncSemaDef0),
    osSemaphore(uartSyncSemaDef1),
    osSemaphore(uartSyncSemaDef2),
    osSemaphore(uartSyncSemaDef3),
    };

static LPC_UART_Type * const uartPtr[UART_NUM_UARTS] = {
    LPC_USART0,(LPC_UART_Type *)LPC_UART1, LPC_USART2, LPC_USART3,};
#if 0
static const IRQn_Type uartIrqs[UART_NUM_UARTS] = {
    UART0_IRQn,
    UART1_IRQn,
    UART2_IRQn,
    UART3_IRQn,};
#endif
static const CLKPWR_Clockswitch uartClockSwitch[UART_NUM_UARTS] = {
    CLKPWR_CLOCKSWITCH_UART0, CLKPWR_CLOCKSWITCH_UART1, CLKPWR_CLOCKSWITCH_UART2, CLKPWR_CLOCKSWITCH_UART3,};
static const CLKPWR_Clock uartClock[UART_NUM_UARTS] = {
    CLKPWR_CLOCK_UART0, CLKPWR_CLOCK_UART1, CLKPWR_CLOCK_UART2, CLKPWR_CLOCK_UART3,};


/* Prototypes */
static void UART_commonIRQHandler (UART_Name uartNum);


/* Open a UART channel. */
LPCLIB_Result UART_open (UART_Name uartNum, UART_Handle *pHandle)
{
    LPC_UART_Type *uart = uartPtr[uartNum];
    UART_Handle handle = &uartContext[uartNum];

    /* Enable UART peripheral clock to allow access to registers */
    CLKPWR_enableClock(uartClockSwitch[uartNum]);

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    ((LPC_FLEXCOMM_Type *)uart)->PSELID = 1;    //TODO
    FLEXCOMM_installHandler((FLEXCOMM_Name)uartNum, (FLEXCOMM_IRQHandler_t)UART_commonIRQHandler);

    uart->FIFOCFG = 0
                    | (1u << UART_FIFOCFG_ENABLETX_Pos)
                    | (1u << UART_FIFOCFG_ENABLERX_Pos)
                    | (0  << UART_FIFOCFG_DMATX_Pos)
                    | (0  << UART_FIFOCFG_DMARX_Pos)
                    ;
    uart->FIFOTRIG = 0
                    | (1u << UART_FIFOTRIG_TXLVLENA_Pos)
                    | (1u << UART_FIFOTRIG_RXLVLENA_Pos)
                    | (0  << UART_FIFOTRIG_TXLVL_Pos)
                    | (0  << UART_FIFOTRIG_RXLVL_Pos)
                    ;
#endif

    /* Cannot open a UART twice */
    if (!uartContext[uartNum].inUse) {
        handle->accessMutex = osMutexCreate(uartMutexes[uartNum]);
        handle->syncSema = osSemaphoreCreate(uartSemas[uartNum], 1);

        uart->INTENCLR = 0xFFFFFFFF;                    /* Disable interrupts */  //TODO
        uart->OSR = 16 - 1;                             /* Default oversampling rate = 16 */
        uart->BRG = 0;                                  /* Baud rate divider = 1 */
        uart->CTL = 0                                   /* Normal */
                    | (0 << UART_CTL_TXDIS_Pos)
                    ;
        uart->CFG = 0                                   /* Enable UART 8N1 */
                    | (1 << UART_CFG_ENABLE_Pos)
                    | (UART_DATABITS_8 << UART_CFG_DATALEN_Pos)
                    | (UART_PARITY_NONE << UART_CFG_PARITYSEL_Pos)
                    | (UART_STOPBITS_1 << UART_CFG_STOPLEN_Pos)
                    ;

        *pHandle = &uartContext[uartNum];
        handle->bus = uartNum;
        handle->inUse = LPCLIB_YES;
        handle->txActive = false;

        /* Enable interrupts */
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
        uart->INTENSET = 0
                    | UART_INTENSET_RXRDYEN_Msk
                    ;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
        uart->FIFOINTENSET = 0
                    | UART_FIFOINTENSET_RXLVL_Msk
                    ;
#endif

        return LPCLIB_SUCCESS;
    }

    *pHandle = LPCLIB_INVALID_HANDLE;

    return LPCLIB_BUSY;
}


/* Close a UART channel */
void UART_close (UART_Handle *pHandle)
{
    LPC_UART_Type *uart;

    if (*pHandle == LPCLIB_INVALID_HANDLE) {
        return;
    }

    uart = uartPtr[(*pHandle)->bus];
    (*pHandle)->inUse = LPCLIB_NO;
    (*pHandle)->txActive = false;

    uart->INTENCLR = 0xFFFFFFFF;                        /* Disable interrupts */  //TODO

    CLKPWR_disableClock(uartClockSwitch[(*pHandle)->bus]);  /* Disable peripheral clock */

    *pHandle = LPCLIB_INVALID_HANDLE;
}


int UART_read (UART_Handle handle, void *buffer, int nbytes)
{
    int nread;

    if (handle == LPCLIB_INVALID_HANDLE) {
        return 0;
    }

    nread = 0;

