einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_uart.c
    while (nbytes > 0) {
        if (handle->rxWriteIndex != handle->rxReadIndex) {
            ((uint8_t *)buffer)[nread] = handle->pRxBuffer[handle->rxReadIndex];
            ++nread;
            ++handle->rxReadIndex;
            if (handle->rxReadIndex >= handle->rxBufferSize) {
                handle->rxReadIndex = 0;
            }
        }
        else {
            break;      /* There is no more RX data available */
        }

        --nbytes;
    }

    return nread;
}


/* Read a complete line (terminated by either CR or LF). */
int UART_readLine (UART_Handle handle, void *buffer, int nbytes)
{
    int nread = 0;
    uint32_t ri = handle->rxReadIndex;
    bool lineComplete = false;
    bool overflow = false;

    if (handle == LPCLIB_INVALID_HANDLE) {
        return 0;
    }

    /* Verify existence of RX FIFO */
    if (!handle->pRxBuffer) {
        return 0;
    }

    /* Verify buffer has enough room */
    if (nbytes < 1) {
        return 0;
    }

    /* Loop over all characters in RX FIFO, until either all characters are consumed
     * or an end-of-line marker is found.
     */
    while (ri != handle->rxWriteIndex) {
        char c = handle->pRxBuffer[ri];

        ++ri;
        if (ri >= handle->rxBufferSize) {
            ri = 0;
        }

        /* Store in buffer (if room left) */
        if (nbytes > 1) {   /* We need room for terminating 0! */
            ((uint8_t *)buffer)[nread] = c;
            --nbytes;
            ++nread;
        }
        else {
            overflow = true;
        }

        /* Line end? */
        if ((c == '\n') || (c == '\r')) {
            lineComplete = true;

            /* Terminate string */
            ((uint8_t *)buffer)[nread] = 0;

            /* Remove characters from RX buffer */
            handle->rxReadIndex = ri;

            if (overflow) {
                nread = -1;
            }
            break;
        }
    }

    /* RX FIFO full without EOL character? */
    if ((uint32_t)(nread + 1) >= handle->rxBufferSize) {
        /* Overflow error (line too long) */
        nread = -1;

        /* Remove characters from RX buffer */
        handle->rxReadIndex = ri;
        lineComplete = true;
    }

    if (!lineComplete) {
        nread = 0;
    }

    return nread;
}


/* Determine number of free TX buffer entries */
int UART_getTxFree (UART_Handle handle)
{
    if (handle == LPCLIB_INVALID_HANDLE) {
        return -1;
    }

    if (handle->pTxBuffer == NULL) {
        return -1;
    }

    uint32_t rdIndex = handle->txReadIndex;
    if (rdIndex > handle->txWriteIndex) {
        return rdIndex - handle->txWriteIndex;
    }

    return handle->txBufferSize - 1 - (handle->txWriteIndex - rdIndex);
}


int UART_write (UART_Handle handle, const void *buffer, int nbytes)
{
    int nwritten;
    uint32_t temp;
    LPC_UART_Type * const uart = uartPtr[handle->bus];


    if (handle == LPCLIB_INVALID_HANDLE) {
        return 0;
    }

    nwritten = 0;

    /* If we have no TX buffer, ignore all data */
    if ((handle->pTxBuffer == NULL) && !handle->txActive) {
        handle->txActive = true;
    }
    else {
        while (nbytes > 0) {
            /* Calculate next index */
            temp = handle->txWriteIndex + 1;
            if (temp >= handle->txBufferSize) {
                temp = 0;
            }

            /* If we would reach the buffer tail now, the buffer is already full! */
            if (temp != handle->txReadIndex) {
                handle->pTxBuffer[handle->txWriteIndex] = ((uint8_t *)buffer)[nwritten];
                handle->txWriteIndex = temp;
                ++nwritten;
                --nbytes;
            }
            else {
                /* Buffer full.
                * Synchronous mode: Wait for signal from TX interrupt.
                * Asynchronous mode: Exit
                *///TODO
                if (handle->txSyncMode) {
                    handle->txActive = true;
                    /* Enable TX interrupt. */
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
                    uart->INTENSET = UART_INTENSET_TXRDYEN_Msk;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
                    uart->FIFOINTENSET = UART_FIFOINTENSET_TXLVL_Msk;
#endif

                    osSemaphoreWait(handle->syncSema, 100 /*TODO*/);
                }
                else {
                    break;
                }
            }
        }
    }

    /* Enable TX interrupt. */
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    uart->INTENSET = UART_INTENSET_TXRDYEN_Msk;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    uart->FIFOINTENSET = UART_FIFOINTENSET_TXLVL_Msk;
#endif

    return nwritten;
}



void UART_ioctl (UART_Handle handle, const UART_Config *pConfig)
{
    uint32_t temp;
    LPC_UART_Type * const uart = uartPtr[handle->bus];

    if (handle == LPCLIB_INVALID_HANDLE) {
        return;
    }

    while (pConfig->opcode != UART_OPCODE_INVALID) {
        switch (pConfig->opcode) {
        case UART_OPCODE_SET_BAUDRATE:
            {
                /* Determine peripheral clock for baud rate generation */
                uint32_t clock = CLKPWR_getBusClock(uartClock[handle->bus]);

                if (uart->CFG & UART_CFG_SYNCEN_Msk) {
                    /* Synchronous mode (no oversampling) */
                    uart->BRG = clock / pConfig->baudrate - 1;  //TODO check parameter
                }
                else {
                    /* Asynchronous mode (uses oversampling) */
                    //TODO: Fractional divider: a) setting support, b) calculation support
                    uint32_t OSR;
                    uint32_t bestOSR;
                    int32_t diff;
                    uint32_t bestDiff;
                    uint32_t BRG;
                    /* Try some OSR values, and keep the one that produces the closest baud rate match */
                    bestDiff = (uint32_t)(-1);
                    bestOSR = 16;
                    for (OSR = 10; OSR <= 16; OSR++) {
                        BRG = (int)(clock / (OSR * pConfig->baudrate));
                        diff = (int)pConfig->baudrate - clock / (OSR * BRG);
                        if (diff < 0) {
                            diff = -diff;
                        }
                        if ((uint32_t)diff < bestDiff) {
                            bestOSR = OSR;
                            bestDiff = diff;
                        }
                    }
                    uart->OSR = (bestOSR - 1) << UART_OSR_OSRVAL_Pos;
                    uart->BRG = clock
                        / ((((uart->OSR & UART_OSR_OSRVAL_Msk) >> UART_OSR_OSRVAL_Pos) + 1) * pConfig->baudrate) - 1;
                }
            }
            break;

        case UART_OPCODE_SET_ASYNC_FORMAT:
            temp = uart->CFG & ~(0
                | UART_CFG_DATALEN_Msk
                | UART_CFG_PARITYSEL_Msk
                | UART_CFG_STOPLEN_Msk
                | UART_CFG_LINMODE_Msk
                | UART_CFG_SYNCEN_Msk
                | UART_CFG_CLKPOL_Msk
                | UART_CFG_SYNCMST_Msk
                );
            uart->CFG = temp
                | ((uint32_t)pConfig->asyncFormat.databits << UART_CFG_DATALEN_Pos)
                | ((uint32_t)pConfig->asyncFormat.stopbits << UART_CFG_STOPLEN_Pos)
                | ((uint32_t)pConfig->asyncFormat.parity << UART_CFG_PARITYSEL_Pos)
                ;
            break;

        case UART_OPCODE_SET_SYNC_FORMAT:
            temp = uart->CFG & ~(0
                | UART_CFG_DATALEN_Msk
                | UART_CFG_PARITYSEL_Msk
                | UART_CFG_STOPLEN_Msk
                | UART_CFG_LINMODE_Msk
                | UART_CFG_SYNCEN_Msk
                | UART_CFG_CLKPOL_Msk
                | UART_CFG_SYNCMST_Msk
                );
            uart->CFG = temp
                | ((uint32_t)pConfig->syncFormat.databits << UART_CFG_DATALEN_Pos)
                | ((uint32_t)pConfig->syncFormat.samplingClock << UART_CFG_CLKPOL_Pos)
                | ((uint32_t)pConfig->syncFormat.syncMaster << UART_CFG_SYNCMST_Pos)
                | (1 << UART_CFG_SYNCEN_Pos)
                ;
            break;

