einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_uart.c
        case UART_OPCODE_SET_CALLBACK:
            if (pConfig->callback.pOldCallback) {       /* Return current callback if requested */
                *(pConfig->callback.pOldCallback) = handle->callback;
            }
            handle->callback = pConfig->callback.callback;
            break;

        case UART_OPCODE_SET_TX_BUFFER:
            handle->pTxBuffer = pConfig->buffer.pBuffer;
            handle->txBufferSize = pConfig->buffer.size;
            break;

        case UART_OPCODE_SET_RX_BUFFER:
            handle->pRxBuffer = pConfig->buffer.pBuffer;
            handle->rxBufferSize = pConfig->buffer.size;
            break;

        case UART_OPCODE_SET_HARDWARE_HANDSHAKE:
            uart->CFG = (uart->CFG & ~UART_CFG_CTSEN_Msk)
                    | (pConfig->hardwareHandshake ? UART_CFG_CTSEN_Msk : 0)
                    ;
            break;

        case UART_OPCODE_SET_BREAK:                     /* TXD break condition */
            if (pConfig->enableBreak) {
#if (__CORTEX_M == 4)
                /* Clean TX disable to allow current character to be sent completely */
                LPCLIB_BITBAND(&uart->CTL, UART_CTL_TXDIS_Pos) = 1;
                while (!LPCLIB_BITBAND(&uart->STAT, UART_STAT_TXDISSTAT_Pos))
                    ;

                /* Enter TXD break */
                LPCLIB_BITBAND(&uart->CTL, UART_CTL_TXBRKEN_Pos) = 1;
#else
                /* Clean TX disable to allow current character to be sent completely */
                uart->CTL |= UART_CTL_TXDIS_Msk;
                while (!(uart->STAT & UART_STAT_TXDISSTAT_Msk))
                    ;

                /* Enter TXD break */
                uart->CTL |= UART_CTL_TXBRKEN_Msk;
#endif
            }
            else {
#if (__CORTEX_M == 4)
                /* Back to normal operation */
                LPCLIB_BITBAND(&uart->CTL, UART_CTL_TXBRKEN_Pos) = 0;
                /* Re-enable TX */
                LPCLIB_BITBAND(&uart->CTL, UART_CTL_TXDIS_Pos) = 0;
#else
                /* Back to normal operation */
                uart->CTL &= ~UART_CTL_TXBRKEN_Msk;
                /* Re-enable TX */
                uart->CTL &= ~UART_CTL_TXDIS_Msk;
#endif
            }
            break;

        case UART_OPCODE_FLUSH_TX_BUFFER:
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
            /* Disable TX interrupt */
            uart->INTENCLR = UART_INTENCLR_TXRDYCLR_Msk;
            /* Wait until current TX character has left the UART */
            uart->CTL |= UART_CTL_TXDIS_Msk;
            while (!(uart->STAT & UART_STAT_TXDISSTAT_Msk))
                ;
            /* Empty the ring buffer */
            handle->txWriteIndex = handle->txReadIndex = 0;
            /* Reenable UART transmitter */
            uart->CTL &= ~UART_CTL_TXDIS_Msk;
            uart->INTENSET = UART_INTENSET_TXRDYEN_Msk;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
            /* Disable TX interrupt (FIFO) */
            uart->FIFOINTENCLR = UART_FIFOINTENCLR_TXLVL_Msk;
            /* Wait until current TX character has left the UART */
            uart->CTL |= UART_CTL_TXDIS_Msk;
            while (!(uart->STAT & UART_STAT_TXDISSTAT_Msk))
                ;
            /* Empty the FIFO */
            uart->FIFOCFG = (uart->FIFOCFG & UART_FIFOCFG_READMASK) | UART_FIFOCFG_EMPTYTX_Msk;
            /* Empty the ring buffer */
            handle->txWriteIndex = handle->txReadIndex = 0;
            /* Reenable UART transmitter */
            uart->CTL &= ~UART_CTL_TXDIS_Msk;
            uart->FIFOINTENSET = UART_FIFOINTENSET_TXLVL_Msk;
#endif
            break;

        case UART_OPCODE_INVALID:
        default:
            /* ignore */
            break;
        }

        ++pConfig;
    }
}


static bool UART_handleTxChar (UART_Handle handle, LPCLIB_Event *pEvent)
{
    (void)pEvent;

    LPC_UART_Type * const uart = uartPtr[handle->bus];

    if (handle->txWriteIndex != handle->txReadIndex) {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
        uart->TXDAT = handle->pTxBuffer[handle->txReadIndex];
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
        uart->FIFOWR = handle->pTxBuffer[handle->txReadIndex];
#endif

        ++(handle->txReadIndex);
        if (handle->txReadIndex >= handle->txBufferSize) {
            handle->txReadIndex = 0;
        }

        return true;                                    /* New character sent */
    }

    return false;                                       /* No character sent */
}


/** Handle a receive character.
 *
 *  If an RX buffer exists, the character is put into that buffer. In case the buffer is full,
 *  the RX character is ignored, and an error counter is incremented.
 *  If no RX buffer exists, the callback handler is informed about the character.
 */
static bool UART_handleRxChar (UART_Handle handle, LPCLIB_Event *pEvent)
{
    LPC_UART_Type * const uart = uartPtr[handle->bus];
    uint8_t c;
    uint32_t temp;

    /* Take character from FIFO */
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    c = uart->RXDAT;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    c = uart->FIFORD;
#endif

    /* If we have no buffer, we must call the callback handler. */
    if (handle->pRxBuffer == NULL) {
        pEvent->parameter = (void *)(0 + c);
        if (handle->callback) {
            pEvent->opcode = UART_EVENT_RX;
            handle->callback(*pEvent);
        }
    }

    /* If we have a buffer, we try to store the character there. */
    if (handle->pRxBuffer != NULL) {
        /* Calculate coming write index */
        temp = handle->rxWriteIndex + 1;
        if (temp >= handle->rxBufferSize) {
            temp = 0;
        }

        /* If we reach the buffer tail, this is an overflow condition.
        * If not, store the character.
        */
        if (temp != handle->rxReadIndex) {
            handle->pRxBuffer[handle->rxWriteIndex] = c;
            handle->rxWriteIndex = temp;

