einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_uart.c
            return true;
        }
    }

    return false;
}



/** Common UART interrupt handling.
 *
 *  \param[in] uartNum UART number
 */
static void UART_commonIRQHandler (UART_Name uartNum)
{
    LPC_UART_Type * const uart = uartPtr[uartNum];
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    uint32_t stat;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    uint32_t fifointstat;
#endif
    LPCLIB_Event event;
    UART_Handle handle = &uartContext[uartNum];


    /* Preset some event fields */
    event.id = LPCLIB_EVENTID_UART;
    event.block = uartNum;

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    stat = uart->STAT;

    if (stat & UART_STAT_RXRDY_Msk) {
        UART_handleRxChar(handle, &event);
    }

    if (stat & UART_STAT_TXRDY_Msk) {
        if (!UART_handleTxChar(handle, &event)) {
            uart->INTENCLR = UART_INTENCLR_TXRDYCLR_Msk;
        }
    }
#endif

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    fifointstat = uart->FIFOINTSTAT;

    if (fifointstat & UART_FIFOINTSTAT_RXLVL_Msk) {
        UART_handleRxChar(handle, &event);
    }

    if (fifointstat & UART_FIFOINTSTAT_TXLVL_Msk) {
        if (!UART_handleTxChar(handle, &event)) {
            uart->FIFOINTENCLR = UART_FIFOINTENCLR_TXLVL_Msk;
        }
    }
#endif
}


#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
/** UART0 interrupt handler.
 */
void UART0_IRQHandler (void)
{
    UART_commonIRQHandler(UART0);
}

/** UART1 interrupt handler.
 */
void UART1_IRQHandler (void)
{
    UART_commonIRQHandler(UART1);
}

/** UART2 interrupt handler.
 */
void UART2_IRQHandler (void)
{
    UART_commonIRQHandler(UART2);
}

/** UART3 interrupt handler.
 */
void UART3_IRQHandler (void)
{
    UART_commonIRQHandler(UART3);
}
#endif

/** @} */

/** @} */

